"No script" = "No script";
"Unknown script" = "Unknown script %d";

"Roman" = "Roman";
"Japanese" = "Japanese";
"Traditional Chinese" = "Traditional Chinese";
"Korean" = "Korean";
"Arabic" = "Arabic";
"Hebrew" = "Hebrew";
"Greek" = "Greek";
"Cyrillic" = "Cyrillic";
"Roman Symbol" = "Roman Symbol";
"Devanagari" = "Devanagari";
"Gurmukhi" = "Gurmukhi";
"Gujarati" = "Gujarati";
"Oriya" = "Oriya";
"Bengali" = "Bengali";
"Tamil" = "Tamil";
"Telugu" = "Telugu";
"Kannada" = "Kannada";
"Malayalam" = "Malayalam";
"Sinhalese" = "Sinhalese";
"Burmese" = "Burmese";
"Khmer" = "Khmer";
"Thai" = "Thai";
"Laotian" = "Laotian";
"Georgian" = "Georgian";
"Armenian" = "Armenian";
"Simplified Chinese" = "Simplified Chinese";
"Tibetan" = "Tibetan";
"Mongolian" = "Mongolian";
"Geez" = "Geez";
"Slavic" = "Slavic";
"Vietnamese" = "Vietnamese";
"Extended Arabic" = "Extended Arabic";

"Default" = "Default";
"1.1" = "1.1";
"10646-1993" = "10646-1993";
"2.0 or later (no surrogates)" = "2.0 or later (no surrogates)";
"3.1 or later (surrogates)" = "3.1 or later (surrogates)";
"3.1 or later (variation sequences)" = "3.1 or later (variation sequences)";
"6.0 or later (full repertoire)" = "6.0 or later (full repertoire)";

"Symbol" = "Symbol";
"Unicode" = "Unicode";
"Shift-JIS" = "Shift-JIS";
"PRC" = "PRC";
"Big-5" = "Big-5";
"Wansung" = "Wansung";
"Johab" = "Johab";
"Reserved1" = "Reserved1";
"Reserved2" = "Reserved2";
"Reserved3" = "Reserved3";
"Unicode Surrogates" = "Unicode Surrogates";
